import numpy as np

# 定义系数矩阵
A = np.array([[28, 0, 0, 0, 19, 0, 0, 0],
              [22, 0, 0, 0, 29, 0, 0, 0],
              [16, 0, 0, 0, 37, 0, 0, 0],
              [56, 0, 0, 0, 47, 0, 0, 0],
              [1, -1, -1, -1, -1, -1, -1,-1],
              [1,-1,-1,-1,-1,-1,-1,-1],
              [1,-1,-1,-1,-1,-1,-1,-1],
              [1,-1,-1,-1,-1,-1,-1,-1]])

# 定义常数向量
b = np.array([11,
              11,
              6,
              8,
              -20,
              -20,
              -20,
              -20])

# 解线性方程组
x = np.linalg.solve(A,b)

# 输出结果
for i in range(8):
    if x[i] > 0:
        print("执行红色", i+1,"次")
    elif x[i] < 0:
        print("执行蓝色", i+5,"次")
print("存在可行解")